FemDesign.Loads.SurfaceTemperatureLoad.#ctor
Parameterless constructor for serialization

FemDesign.Loads.SurfaceTemperatureLoad.#ctor(FemDesign.Geometry.Region,FemDesign.Geometry.Vector3d,System.Collections.Generic.List{FemDesign.Loads.TopBotLocationValue},FemDesign.Loads.LoadCase,System.String)
Construct a surface temperature load by region and temperature location values (top/bottom)
region: Region
direction: Direction of load
tempLocValue: List of top bottom location value. List should have 1 or 3 elements.>
loadCase: LoadCase.
comment: Comment.

FemDesign.Loads.SurfaceTemperatureLoad.#ctor(FemDesign.Geometry.Region,FemDesign.Geometry.Vector3d,System.Double,System.Double,FemDesign.Loads.LoadCase,System.String)
Construct surface temperature load by region, top value and bottom value.
region: Region
direction: Direction of load
topVal: Top value, temperature in celsius
bottomVal: Bottom value, temperature in celsius
loadCase: LoadCase.
comment: Comment.